app/Controllers/ProductController.php

    public function syncProducts()
    {
		//die('SyncProducts method was called');
        $shopifyModel = new ShopifyModel();
        $productModel = new ProductModel();

        // Fetch all products from Shopify
        $shopifyProducts = $shopifyModel->getProducts();

        $syncCount = 0; // Initialize sync count

        // Loop through each Shopify product and insert/update in local DB
        foreach ($shopifyProducts as $shopifyProduct) {
            // Prepare data for insertion or update
            $productData = [
                'shopify_product_id' => $shopifyProduct->id,
                'title' => $shopifyProduct->title,
                'price' => $shopifyProduct->variants[0]->price,
                'image_url' => $shopifyProduct->image->src ?? null,
            ];

            // Check if the product already exists in the local DB
            $existingProduct = $productModel->where('shopify_product_id', $shopifyProduct->id)->first();

            if ($existingProduct) {
                // Update the existing product
                $productModel->update($existingProduct->id, $productData);
---
UPDATE `shopify_products` SET `shopify_product_id` = 5477945999516, `title` = 'Earthen', `price` = '26.95', `image_url` = 'https://cdn.shopify.com/s/files/1/0446/8182/2364/products/prodduct-1.png?v=1610198985'
WHERE `shopify_products`.`id` IN ('1')